# CLI encryption tool
brew "age"

# Shell history tool
brew "atuin"

# Enhanced replacement of cat
brew "bat"

# The best programming language
tap "clojure/tools"
brew "clojure"
brew "leiningen"

# The best editor
brew "emacs"

# Enhanced replacement of ls
brew "exa"

# Lua and a Lisp syntax
brew "lua"
brew "fennel"

# Github CLI tool
brew "gh"

# Newer version of Git
brew "git"

# Enhanced replacement for top
brew "htop"

# Manage Java runtimes and maven build tool
brew "jenv"
brew "maven"

# Manage node runtimes
brew "nvm"

# Manage ruby runtimes
brew "rbenv"

# Enhance CLI inputs
brew "readline"
brew "rlwrap"

# Install symlinks structures, e.g. dotfiles
brew "stow"

# Summary of CLI tool usage
brew "tldr"

# Terminal multiplexer
brew "tmux"

# Watch output of a command
brew "watch"

# Retrieve files from network/internet
brew "wget"

# Jump to visited directories in shell
brew "z"
